## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                      NAME                                                      |
|--------|----------------------------------------------------------------------------------------------------------------|
| add    | `aws_identitystore_group.notify_production_hosted_zone_admin`                                                  |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-HostedZone-Admin-Route53-Notify-Admin&quot;]` |
|        | `aws_ssoadmin_permission_set.admin_route53_notify_hosted_zone`                                                 |
|        | `aws_ssoadmin_permission_set_inline_policy.admin_route53_notify_hosted_zone`                                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group.notify_production_hosted_zone_admin will be created
  + resource "aws_identitystore_group" "notify_production_hosted_zone_admin" {
      + description       = "Grants members administrator access to the Notify Production account's Route 53 hosted zone record sets."
      + display_name      = "Notify-Production-HostedZone-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-HostedZone-Admin-Route53-Notify-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_permission_set.admin_route53_notify_hosted_zone will be created
  + resource "aws_ssoadmin_permission_set" "admin_route53_notify_hosted_zone" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Grants full access to the Notify hosted zone's record sets in Route 53."
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + name             = "Route53-Notify-Admin"
      + session_duration = "PT1H"
      + tags_all         = (known after apply)
    }

  # aws_ssoadmin_permission_set_inline_policy.admin_route53_notify_hosted_zone will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "admin_route53_notify_hosted_zone" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ListHostedZonesByName",
                          + "route53:ListHostedZones",
                          + "route53:GetHostedZoneCount",
                          + "route53:GetHostedZone",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListHostedZones"
                    },
                  + {
                      + Action   = [
                          + "route53:ListResourceRecordSets",
                          + "route53:GetChange",
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/Z1XG153PQF3VV5"
                      + Sid      = "UpdateNotifyHostedZoneRecordSets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_route53_notify_hosted_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.canadian_digital_service_production_website_admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.rds_query_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
